{
	"info_panels": {
		"info_alternator":
		{
			"title": "Alternator",
			"text": "A belt-driven, 28 volt, 60 ampere alternator powers the electrical system. The alternator is controlled by the red ALT MASTER switch found near the top of the pilot’s switch panel. Power from the X-FEED BUS via the ALT FIELD circuit breaker is required for the alternator to generate power."		},
		"info_starter":{
			"title": "Starter",
			"text": "If power is available from the main battery or from an external power source, turning the ignition switch to START will close the starter relay and activate the starter motor, starting the engine."
		},
        "info_battery":{
            "title": "Battery",
			"text":  "The 24-volt main battery is located inside the engine cowling on the left firewall. The battery is controlled by the red BAT MASTER switch found near the top of the pilot’s switch panel. The battery provides power for starting the engine and for operating the electrical system when the alternator is not functioning."
        },
        "info_eis":{
            "title": "Engine Indication System",
            "text": "Electrical system data is displayed at the bottom of the Engine Indication System (EIS) bar along the left side of the MFD. Main bus voltage is measured at the WARN circuit breaker on the X-FEED BUS. Essential bus voltage is measured at the NAV1 ENG circuit breaker on the ESS BUS. \n Both voltage (VOLTS) and current (AMPS) indications are shown on the EIS. Main bus voltage is shown below the “M”. Essential bus voltage is shown below the “E”. Main battery current is shown below the “M”. Standby battery current is displayed below the “S”. A positive AMPS value means the battery is charging, a negative value means that the battery is discharging. \n Normal voltage readings with the alternator operating should be about 28.0 volts. If main or essential bus voltage rises above 32.0 volts, the numerical value and VOLTS text turns red. This warning indication, along with a HIGH VOLTS annunciation on the PFD, is an indicator that the alternator is supplying too high of a voltage and the ALT MASTER switch should be positioned to OFF. \n If main or essential bus voltage drops below 24.5 volts, the numeric value and VOLTS text turns red. This warning indication, along with a LOW VOLTS annunciation on the PFD, is an indication that the alternator is not supplying enough power. Voltages between 24.5 and 28.0 volts may occur during low engine RPM conditions."
        },
		"info_acu_box": {
			"title": "Alternator Control Unit",
			"text": "The alternator control unit (ACU) controls several functions of the alternator circuit. The ACU adjusts the alternator field current to regulate alternator output, supplying the main bus with approximately 28.5 volts. The ACU also monitors main bus voltage and activates the LOW VOLTS annunciator below approximately 24.5 volts. \n In the event of an overvoltage condition (or other alternator fault), the ACU will automatically open the ALT FIELD circuit breaker, removing alternator field current and stopping alternator output. The ALT FIELD circuit breaker can be reset to energize the ACU and enable the alternator. \n Since the ACU will normally disconnect the alternator in a high volts situation, illumination of the HIGH VOLTS annunciator indicates that the normal alternator shutdown circuit is not operational and the pilot should turn the alternator off manually but switching the ALT MASTER switch OFF."
		},
		"info_bus_x-feed": {
			"title": "X-Feed Bus",
			"text": "The crossfeed bus (X-FEED BUS) ensures that power is available from either ELEC BUS 1 or ELEC BUS 2 for the ALT FIELD and WARN circuits. Despite the name, the crossfeed bus does not allow power to crossfeed from one primary bus to the other. For example, the diodes installed in the circuit connecting ELEC BUS 2 to the X-FEED BUS will not allow power to flow from ELEC BUS 1 to ELEC BUS 2 via the X-FEED BUS. Therefore, if the FEEDER A circuit breaker is open, there will be no power available to ELEC BUS 2."
		},
		"info_bus_avn1": {
			"title": "Avionics Bus 1",
			"text": "Avionics Bus 1 (AVN BUS 1) is powered when the MASTER switch and the AVIONICS BUS 1 switch are in the ON position. The avionics on AVN BUS 1 can also be powered via the ESS BUS. This redundancy allows for these essential avionics to be operated in the event that the standby battery is the only power source available. \n CAUTION: Both AVIONICS BUS 1 and AVIONICS BUS 2 switches should be turned OFF to prevent any harmful transient voltage from damaging the avionics equipment prior to turning the MASTER switch ON or OFF, starting the engine, or applying an external power source."
		},
		"info_breaker_landing_lights": {
			"title": "Landing Lights Circuit Breaker",
			"text": "The landing light circuit is protected by a 10-amp LAND LT circuit breaker, located on ELEC BUS 1."
		},
		"info_breaker_avn2_xpndr": {
			"title": "XPNDR Circuit Breaker",
			"text": "The G1000 Transponder init is protected by a 5-amp XPNDR circuit breaker, located on AVN BUS 2"
		},
		"info_breaker_avn2_nav2": {
			"title": "NAV 2 Circuit Breaker",
			"text": "The Navigation #2 unit and Aft Avionics Cooling Fan are protected by a 5-amp NAV 2 circuit breaker, located on AVN BUS 2."
		},
		"info_breaker_avn2_comm2": {
			"title": "Comm 2 Circuit Breaker",
			"text": "The G1000 VHF Communication #2 unit is protected by a 5-amp COMM 2 circuit breaker, located on AVN BUS 2."
		},
		"info_breaker_avn2_audio": {
			"title": "Audio Circuit Breaker",
			"text": "The G1000 Audio Panel unit is protected by a 5-amp AUDIO circuit breaker, located on AVN BUS 2."
		},
		"info_breaker_avn2_auto_pilot": {
			"title": "Auto Pilot Circuit Breaker",
			"text": "The G1000 Auto Pilot unit is protected by a 5-amp AUTO PILOT circuit breaker, located on AVN BUS 2."
		},
		"info_starter_relay": {
			"title": "Starter Relay",
			"text": "The starter relay is energized by the ignition switch. The relay closes the circuit between the battery (or external power source) and the starter motor."
		},
		"info_battery_relay": {
			"title": "Battery Relay",
			"text": "The battery relay closes the circuit between the battery (or external power source) and the rest of the electrical system. Turning the BAT MASTER switch ON will energize the battery relay."
		},
		"info_external_power_relay": {
			"title": "External Power Relay",
			"text": "As long as the BAT MASTER switch is ON, the external power relay and battery relay will both automatically close when a power source is plugged into the external power receptacle. This will allow the external power source to act as the aircraft’s battery, providing power to the entire electrical system."
		},
		"info_switch_alt_master": {
			"title": "Alternator Master Switch",
			"text": "The ALT side of the red MASTER switch controls the alternator system. If ALT FIELD power is available at the ESS BUS, turning the ALT MASTER switch ON will energize the alternator relay and connect the alternator to the electrical system. \n In normal operation, both sides of the switch (ALT and BAT) are operated simultaneously. However, the BAT side of the switch may be selected separately as necessary. The ALT side cannot be set to ON without the BAT side also being set to ON."
		},
		"info_ignition_switch": {
			"title": "Ignition Switch",
			"text": "If power is available from the main battery or from an external power source, turning the ignition switch to START will close the starter relay, engage the starter, and start the engine."
		},
		"info_breaker_feeder_b": {
			"title": "Feeder B Circuit Breaker",
			"text": "The power distribution module uses three push-to-reset circuit breakers for the electrical bus feeders. A fast blow automotive type fuse is used at the standby battery. The standby battery current shunt circuit uses two field replaceable fuses located on the standby battery controller printed circuit board."
		},
		"info_breaker_feeder_a": {
			"title": "Feeder A Circuit Breaker",
			"text": "The power distribution module uses three push-to-reset circuit breakers for the electrical bus feeders. A fast blow automotive type fuse is used at the standby battery. The standby battery current shunt circuit uses two field replaceable fuses located on the standby battery controller printed circuit board."
		},
		"info_switch_battery_master": {
			"title": "Battery Master Switch",
			"text": "The BAT side of the MASTER switch controls the main battery electrical power to the airplane. When the BAT MASTER is switched ON, the battery relay is energized and the battery is connected to the electrical system. \n In normal operation, both sides of the switch (ALT and BAT) are operated simultaneously. However, the BAT side of the switch may be selected separately as necessary. The ALT side cannot be set to ON without the BAT side also being set to ON."
		},
		"info_breaker_avn2": {
			"title": "AVN 2 Circuit Breaker",
			"text": "Power to AVN BUS 2 is fed from ELEC BUS 2 through a 15-amp AVN 2 circuit breaker."
		},
		"info_breaker_pitot_heat": {
			"title": "Pitot Heat Circuit Breaker",
			"text": "The pitot heat circuit is protected by a 5-amp PITOT HEAT circuit breaker, located on ELEC BUS 2."
		},
		"info_breaker_nav_lights": {
			"title": "Navigation Lights Circuit Breaker",
			"text": "The navigation lights and control wheel map light circuits are protected by a 5-amp NAV LTS circuit breaker, located on ELEC BUS 2."
		},
		"info_breaker_taxi_lights": {
			"title": "Taxi Lights Circuit Breaker",
			"text": "The taxi light circuit is protected by a 10-amp TAXI LT circuit breaker, located on ELEC BUS 2."
		},
		"info_breaker_strobe_lights": {
			"title": "Strobe Lights Circuit Breaker",
			"text": "The strobe lights circuit is protected by a 5-amp STROBE LTS circuit breaker, located on ELEC BUS 2."
		},
		"info_breaker_panel_lights": {
			"title": "Panel Lights Circuit Breaker",
			"text": "The panel lights circuit is protected by a 5-amp PANEL LTS circuit breaker, located on ELEC BUS 2."
		},
		"info_breaker_stdby_battery": {
			"title": "Standby Battery Circuit Breaker",
			"text": "Power to and from the standby battery system flows through a 20-amp STDBY BATT circuit breaker, located on the ESS BUS."
		},
		"info_breaker_stdby_ind_lights": {
			"title": "Standby IND Lights Circuit Breaker",
			"text": "The lighting system for the standby flight instruments is protected by a 5-amp STDBY IND LTS circuit breaker, located on the ESS BUS."
		},
		"info_breaker_ess_comm1": {
			"title": "COMM 1 Circuit Breaker",
			"text": "The G1000 VHF Communication #1 unit is protected by a 5-amp COMM 1 circuit breaker, located on the ESS BUS."
		},
		"info_breaker_ess_nav1_eng": {
			"title": "NAV 1 ENG Circuit Breaker",
			"text": "The G1000 Navigation #1 and Engine/Airframe units are protected by a 15-amp NAV1 ENG circuit breaker, located on the ESS BUS. In the event that there is no power available for AVN BUS 1 or if operating on standby battery power, the Navigation #1 and Engine/Airframe units can be powered by the ESS BUS through this circuit breaker."
		},
		"info_breaker_ess_adc_ahrs": {
			"title": "ADC AHRS Circuit Breaker",
			"text": "The G1000 Air Data Computer and Attitude Heading Reference System are protected by a 10-amp ADC AHRS circuit breaker, located on the ESS BUS. In the event that there is no power available for AVN BUS 1 or if operating on standby battery power, the ADC and AHRS can be powered by the ESS BUS through this circuit breaker."
		},
		"info_breaker_ess_pfd": {
			"title": "PFD Circuit Breaker",
			"text": "The G1000 Primary Flight Display is protected by a 5-amp PFD circuit breaker, located on the ESS BUS. Note that this circuit allows the PFD to be powered by any available power source, including the standby battery. Utilizing this circuit, the PFD can operate even with the AVIONICS switches OFF."
		},
		"info_breaker_warn": {
			"title": "WARN Circuit Breaker",
			"text": "Power is fed from the WARN circuit breaker on the X-FEED bus to the stall warning, ELT, main bus voltmeter, hourmeter, starter relay, standby battery, and main bus sense circuits."
		},
		"info_breaker_alt_field": {
			"title": "ALT FIELD Circuit Breaker",
			"text": "In the event of an overvoltage condition (or other alternator fault), the ALT FIELD circuit breaker is automatically opened by the alternator control unit (ACU), removing alternator field current and stopping alternator output. The ALT FIELD circuit breaker can be reset to energize the ACU and enable the alternator. If warning annunciators are extinguished and the main battery is charging, then normal alternator output has been restored. If the LOW VOLTS annunciator comes on again or the ALT FIELD circuit breaker opens again, an alternator malfunction has occurred. The ALT FIELD circuit breaker should not be reset again. \n The ALT FIELD circuit breaker may open on occasion during normal engine starts due to transient voltages. Provided that normal alternator function is restored when the circuit breaker is reset, this can be considered a nuisance event."
		},
		"info_breaker_avn1": {
			"title": "AVN 1 Circuit Breaker",
			"text": "Power to AVN BUS 1 is fed from ELEC BUS 1 through a 15-amp AVN 1 circuit breaker."
		},
		"info_breaker_flaps": {
			"title": "Flaps Circuit Breaker",
			"text": "The wing flaps circuit is protected by a 10-amp FLAPS circuit breaker, located on ELEC BUS 1."
		},
		"info_breaker_cabin_lights": {
			"title": "Cabin Lights Circuit Breaker",
			"text": "The overhead lights and 12V cabin power circuits are protected by a 5-amp CABIN LTS/PWR circuit breaker, located on ELEC BUS 1."
		},
		"info_breaker_beacon_lights": {
			"title": "Beacon Lights Circuit Breaker",
			"text": "The flashing beacon circuit is protected by a 5-amp BCN LT circuit breaker, located on ELEC BUS 1."
		},
		"info_breaker_fuel_pump": {
			"title": "Fuel Pump Circuit Breaker",
			"text": "The auxiliary (electric) fuel pump is protected by a 5-amp FUEL PUMP circuit breaker, located on ELEC BUS 1."
		},
		"info_breaker_avn1_pfd": {
			"title": "PFD Circuit Breaker",
			"text": "The G1000 Primary Flight Display and cooling fans are protected by a 5-amp PFD circuit breaker, located on AVN BUS 1. In the event that power is not available to AVN BUS 1, the PFD and cooling fans can get power via an identical circuit breaker on the ESS BUS."
		},
		"info_breaker_avn1_adc_ahrs": {
			"title": "ADC AHRS Circuit Breaker",
			"text": "The G1000 Air Data Computer and Attitude Heading Reference System are protected by a 10-amp ADC AHRS circuit breaker, located on AVN BUS 1. In the event that power is not available to AVN BUS 1, the ADC and AHRS can get power via an identical circuit breaker on the ESS BUS."
		},
		"info_breaker_avn1_nav1_eng": {
			"title": "NAV 1 ENG Circuit Breaker",
			"text": "The G1000 Navigation #1 and Engine/Airframe units are protected by a 15-amp NAV1 ENG circuit breaker, located on AVN BUS 1. In the event that power is not available to AVN BUS 1, these units can get power via an identical circuit breaker on the ESS BUS."
		},
		"info_standby_battery": {
			"title": "Standby Battery",
			"text": "The standby battery is located between the firewall and the instrument panel, behind the PFD, and is controlled by the STBY BATT switch. This battery is available to supply 30 minutes of power to the ESS BUS in the event that alternator and main battery power sources have both failed. \n The STBY BATT annunciator will illuminate when discharge rates are greater than 0.5 amps for more than 10 seconds. \n The standby battery is charged during flight when the STBY BATT switch is placed in the ARM position. At 20 Volts, the standby battery has little or no capacity remaining."
		},
		"info_bus_elec1": {
			"title": "Electric Bus 1",
			"text": "Each electrical bus provides a common distribution point that feeds power to the aircraft’s various electrical components. Power is supplied to most electrical circuits through two primary buses, ELEC BUS 1 and ELEC BUS 2."
		},
		"info_ess_bus": {
			"title": "ESS Bus",
			"text": "The essential bus (ESS BUS) isolates essential equipment on a single bus. The essential bus can receive power from the main battery or alternator via ELEC BUS 1 or ELEC BUS 2. Unlike the other buses in the system, the ESS BUS is the only bus that can receive power from the standby battery. Diodes in the circuits connecting the ESS BUS to the primary buses will not allow standby battery power to flow to the primary buses. In the event that the standby battery is the only power source, power will only be available to the components on the ESS BUS."
		},
		"info_bus_avn2": {
			"title": "AVN 2 Bus",
			"text": "Avionics Bus 2 (AVN BUS 2) is powered when the MASTER switch and the AVIONICS BUS 2 switch are in the ON position. The avionics on this bus are considered non-essential and will not function when the standby battery is the only source of power available. \n CAUTION: Both AVIONICS BUS 1 and AVIONICS BUS 2 switches should be turned OFF to prevent any harmful transient voltage from damaging the avionics equipment prior to turning the MASTER switch ON or OFF, starting the engine, or applying an external power source."
		},
		"info_breaker_avn2_mfd": {
			"title": "MFD Circuit Breaker",
			"text": "The G1000 Multi-Function Display and MFD Fan circuits are protected by a 5-amp MFD circuit breaker, located on AVN BUS 2."
		},
		"info_breaker_avn1_fis": {
			"title": "FIS Circuit Breaker",
			"text": "The G1000 FIS unit is protected by a 5-amp FIS circuit breaker, located on AVN BUS 1."
		},
		"info_switch_standby_battery_master": {
			"title": "Standby Battery Switch",
			"text": "The standby battery (STBY BATT) switch is a three-position switch (ARM-OFF-TEST) that tests and controls the standby battery system. The standby battery energy level can be tested by placing the switch in the momentary TEST position for 10 seconds and observing the correct illumination of the TEST lamp. \n Placing the switch in the ARM position during engine start allows the standby battery to help regulate and filter ESS BUS voltage during the start cycle. \n The switch is set to the ARM position during normal flight operation to allow the standby battery to charge and to be ready to power the ESS BUS in the event of alternator and main battery failure. \n Placing the switch in the OFF position disconnects the standby battery from the ESS BUS. Operation in the OFF position prevents the standby battery from charging and from automatically providing power should an electrical system failure occur."
		},
		"info_test_led": {
			"title": "Test LED",
			"text": "The TEST LED is illuminated when the STBY BATT switch is moved to the TEST position. To test the standby battery, the switch should be held in the TEST position for 10 seconds. During the test, if the LED is not illuminated continuously, the standby battery test has failed."
		},
		"info_standby_eis": {
			"title": "Engine Indication System",
			"text": "Electrical system data is displayed at the bottom of the Engine Indication System (EIS) bar along the left side of the MFD. Main bus voltage is measured at the WARN circuit breaker on the X-FEED BUS. Essential bus voltage is measured at the NAV1 ENG circuit breaker on the ESS BUS. \n Both voltage (VOLTS) and current (AMPS) indications are shown on the EIS. Main bus voltage is shown below the “M”. Essential bus voltage is shown below the “E”. Main battery current is shown below the “M”. Standby battery current is displayed below the “S”. A positive AMPS value means the battery is charging, a negative value means that the battery is discharging. \n Normal voltage readings with the alternator operating should be about 28.0 volts. If main or essential bus voltage rises above 32.0 volts, the numerical value and VOLTS text turns red. This warning indication, along with a HIGH VOLTS annunciation on the PFD, is an indicator that the alternator is supplying too high of a voltage and the ALT MASTER switch should be positioned to OFF. \n If main or essential bus voltage drops below 24.5 volts, the numeric value and VOLTS text turns red. This warning indication, along with a LOW VOLTS annunciation on the PFD, is an indication that the alternator is not supplying enough power. Voltages between 24.5 and 28.0 volts may occur during low engine RPM conditions."
		},
		"info_switch_test_overheat": {
			"title": "Test Overheat Switch",
			"text": "The test load can get hot during the standby battery test. If the circuit gets too hot, the test overheat switch will open, preventing damage to the load and anything else located nearby."
		},
		"info_switch_fuel_pump": {
			"title": "Fuel Pump Switch",
			"text": "The FUEL PUMP switch is used by the pilot to activate the auxiliary (electric) fuel pump."
		},
		"info_switch_beacon_lights": {
			"title": "Beacon Lights Switch",
			"text": "The BEACON switch is used by the pilot to activate the red flashing beacon on top of the vertical stabilizer."
		},
		"info_switch_landing_lights": {
			"title": "Landing Lights Switch",
			"text": "The LAND switch is used by the pilot to activate the landing light in the left wing. Note that the PULSELITE switch (not shown in the schematic) can also be used to activate the taxi and landing lights."
		},
		"info_switch_cabin_lights": {
			"title": "Cabin Lights Switch",
			"text": "The CABIN LTS/PWR switch depicted in the schematic represents both the various cabin lighting controls available to the pilot as well as the CABIN PWR 12V switch."
		},
		"info_switch_avn1": {
			"title": "Avionics Bus 1 Switch",
			"text": "The BUS 1 side of the AVIONICS switch controls electrical power to avionics bus 1 (AVN BUS 1). Both sides of the AVIONICS switch should be placed in the OFF position before turning the MASTER switch ON or OFF, starting the engine, or applying an external power source. "
		},
		"info_switch_avn2": {
			"title": "Avionics Bus 2 Switch",
			"text": "The BUS 2 side of the AVIONICS switch controls electrical power to avionics bus 2 (AVN BUS 2). Both sides of the AVIONICS switch should be placed in the OFF position before turning the MASTER switch ON or OFF, starting the engine, or applying an external power source."
		},
		"info_switch_pitot_heat": {
			"title": "Pitot Heat Switch",
			"text": "The PITOT HEAT switch is used by the pilot to activate the pitot heat."
		},
		"info_switch_nav_lights": {
			"title": "Navigation Lights Switch",
			"text": "The NAV switch is used by the pilot to activate the navigation lights on the wingtips and tail, and the control wheel map light."
		},
		"info_switch_taxi_lights": {
			"title": "Taxi Lights Switch",
			"text": "The TAXI switch is used by the pilot to activate the taxi light in the left wing. Note that the PULSELITE switch (not shown in the schematic) can also be used to activate the taxi and landing lights."
		},
		"info_switch_strobe_lights": {
			"title": "Strobe Lights Switch",
			"text": "The STROBE switch is used by the pilot to activate the strobe lights on the wingtips."
		},
		"info_switch_panel_lights": {
			"title": "Panel Lights switch",
			"text": "The PANEL LTS switch in the schematic represents the various controls available to the pilot for activating instrument panel illumination, including the SW/CB PANELS, PEDESTAL, and AVIONICS rheostats (not shown in this trainer)."
		},
        "info_alt_relay": {
			"title": "Alternator Relay",
			"text": "The alternator relay closes the circuit between the alternator and the rest of the electrical system. This relay is energized by turning the ALT MASTER switch ON. A different power source is required to close this relay, such as the main battery or an external power source."
		},
        "info_power_distribution_module": {
			"title": "Power Distribution Module",
			"text": "The power distribution module, located on the left forward side of the firewall, houses all the relays used in the electrical system. The alternator control unit (ACU), current sensor, and the external power connector are also housed within this module. \n The power distribution module includes two circuit breakers for the circuits that feed ELEC BUS 1 and ELEC BUS 2. These circuit breakers are not accessible in flight, but users of this trainer can click on the circuit breakers in the schematic to open and close them. \n The external power receptacle is integral to the power distribution module and allows the use of an external power source for cold weather starting or for lengthy maintenance work on electrical and avionics equipment. An external door on the left side of the cowling can be opened to access the receptacle. "
		},
        "info_stby_battery_controller": {
			"title": "Standby Battery Controller",
			"text": "The standby battery controller is a solid-state unit that controls and monitors the release of electrical power to and from the standby battery."
		},
        "info_test_load": {
			"title": "Test Load",
			"text": "During the standby battery test, placing a load on the standby battery ensures that available energy levels are sufficient and that the battery can provide a consistent voltage."
		}
	},
	"graph_data": [
		{
			"id": "#battery",
			"is_source": true,
			"has_on_off": false,
			"edges": [
				"#battery_relay",
				"#external_power_relay"
			],
			"passthrough": true,
			"class_name": "on_battery"
		},
		{
			"id": "#alt_input",
			"is_source": true,
			"has_on_off": false,
			"edges": [
				"#alt_relay"
			],
			"requires": [
				"#alt_relay"
			],
			"passthrough": false,
			"class_name": "on_alternator"
		},
		{
			"id": "#external_power",
			"is_source": true,
			"has_on_off": false,
			"edges": [
				"#external_power_relay"
			],
			"passthrough": false,
			"class_name": "on_external_power"
		},
		{
			"id": "#standby_battery",
			"is_source": true,
			"has_on_off": false,
			"edges": [
				"#switch_stb_arm",
				"#switch_stb_test"
			],
			"passthrough": true,
			"class_name": "on_standby_battery"
		},
		{
			"id": "#low_volt_indicator",
			"has_on_off": false,
			"edges": [
				"#alt_relay"
			],
			"passthrough": true
		},
		{
			"id": "#external_power_relay",
			"has_on_off": true,
			"edges": [
				"#external_power",
				"#battery",
				"#ground"
			],
			"requires": [
				"#switch_battery_master",
				"#external_power"
			],
			"passthrough": false
		},
		{
			"id": "#ground",
			"has_on_off": false,
			"edges" : [
				"#external_power_relay"
			],
			"passthrough": true
		},
		{
			"id": "#battery_relay",
			"has_on_off": true,
			"edges": [
				"#battery",
				"#switch_battery_master",
				"#alt_relay",
				"#breaker_feeder_a_svg",
				"#breaker_feeder_b_svg",
				"#low_volt_indicator"
			],
			"passthrough": false
		},
		{
			"id": "#alt_relay",
			"has_on_off": true,
			"edges": [
				"#battery_relay",
				"#switch_alt_master"
			],
			"passthrough": false
		},
		{
			"id": "#switch_battery_master",
			"has_on_off": true,
			"edges": [
				"#battery_relay"
			],
			"passthrough": false
		},
		{
			"id": "#switch_alt_master",
			"has_on_off": true,
			"edges": [
				"#alt_relay",
				"#breaker_alt_field_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_feeder_a_svg",
			"has_on_off": true,
			"edges": [
				"#battery_relay",
				"#breaker_avn2_svg",
				"#breaker_pitot_heat_svg",
				"#breaker_nav_light_svg",
				"#breaker_taxi_light_svg",
				"#breaker_strobe_light_svg",
				"#breaker_panel_lights_svg",
				"#x-feed_bus",
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_avn2_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_a_svg",
				"#switch_avn2_svg"
			],
			"passthrough": true
		},
		{
			"id": "#switch_avn2_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_avn2_svg",
				"#breaker_mfd_svg",
				"#breaker_xpndr_svg",
				"#breaker_nav2_svg",
				"#breaker_comm2_svg",
				"#breaker_audio_svg",
				"#breaker_auto_pilot_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_mfd_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn2_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_xpndr_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn2_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_nav2_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn2_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_comm2_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn2_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_audio_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn2_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_pitot_heat_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_a_svg",
				"#switch_pitot_heat_svg"
			],
			"passthrough": true
		},
		{
			"id": "#switch_pitot_heat_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_pitot_heat_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_nav_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_a_svg",
				"#switch_nav_light_svg"
			],
			"passthrough": true
		},
		{
			"id": "#switch_nav_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_nav_light_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_taxi_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_a_svg",
				"#switch_taxi_light_svg"
			],
			"passthrough": true
		},
		{
			"id": "#switch_taxi_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_taxi_light_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_strobe_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_a_svg",
				"#switch_strobe_light_svg"
			],
			"passthrough": true
		},
		{
			"id": "#switch_strobe_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_strobe_light_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_auto_pilot_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn2_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_panel_lights_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_a_svg",
				"#switch_panel_lights_svg"
			],
			"passthrough": true
		},
		{
			"id": "#switch_panel_lights_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_panel_lights_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_feeder_b_svg",
			"has_on_off": true,
			"edges": [
				"#battery_relay",
				"#breaker_fuel_pump_svg",
				"#breaker_beacon_light_svg",
				"#breaker_land_light_svg",
				"#breaker_cabin_lights_svg",
				"#breaker_flaps_svg",
				"#breaker_avn1_svg",
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_fuel_pump_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_b_svg",
				"#switch_fuel_pump_svg"
			],
			"passthrough": true
		},	
		{
			"id": "#switch_fuel_pump_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_fuel_pump_svg"
			],
			"passthrough": false
		},
				{
			"id": "#breaker_beacon_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_b_svg",
				"#switch_beacon_light_svg"
			],
			"passthrough": true
		},	
		{
			"id": "#switch_beacon_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_beacon_light_svg"
			],
			"passthrough": false
		},
				{
			"id": "#breaker_land_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_b_svg",
				"#switch_land_light_svg"
			],
			"passthrough": true
		},	
		{
			"id": "#switch_land_light_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_land_light_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_cabin_lights_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_b_svg",
				"#switch_cabin_lights_svg"
			],
			"passthrough": true
		},	
		{
			"id": "#switch_cabin_lights_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_cabin_lights_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_flaps_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_b_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_avn1_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_feeder_b_svg",
				"#switch_avn1_svg"
			],
			"passthrough": true
		},
		{
			"id": "#switch_avn1_svg",
			"has_on_off": true,
			"edges": [
				"#breaker_avn1_svg",
				"#breaker_avn1_pfd_svg",
				"#breaker_avn1_adc_ahrs_svg",
				"#breaker_avn1_nav1_eng",
				"#breaker_avn1_fis_svg"
			],
			"passthrough": false
		},
		{
			"id": "#breaker_avn1_pfd_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn1_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_avn1_adc_ahrs_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn1_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_avn1_nav1_eng",
			"has_on_off": true,
			"edges": [
				"#switch_avn1_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_avn1_fis_svg",
			"has_on_off": true,
			"edges": [
				"#switch_avn1_svg"
			],
			"passthrough": true
		},
		{
			"id": "#x-feed_bus",
			"has_on_off": false,
			"edges": [
				"#breaker_warn_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_alt_field_svg",
			"has_on_off": true,
			"edges": [
				"#switch_alt_master",
				"#x-feed_bus"
			],
			"passthrough": true
		},	
		{
			"id": "#breaker_warn_svg",
			"has_on_off": true,
			"edges": [
				"#x-feed_bus"
			],
			"passthrough": true
		},
		{
			"id": "#ess_bus",
			"has_on_off": false,
			"edges": [
				"#breaker_ess_pfd_svg",
				"#breaker_ess_adc_ahrs_svg",
				"#breaker_ess_nav1_eng_svg",
				"#breaker_ess_comm1_svg",
				"#breaker_ess_stdby_ind_lts_svg",
				"#breaker_ess_stdby_battery_svg"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_ess_pfd_svg",
			"has_on_off": true,
			"edges": [
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_ess_adc_ahrs_svg",
			"has_on_off": true,
			"edges": [
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_ess_nav1_eng_svg",
			"has_on_off": true,
			"edges": [
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_ess_comm1_svg",
			"has_on_off": true,
			"edges": [
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_ess_stdby_ind_lts_svg",
			"has_on_off": true,
			"edges": [
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#breaker_ess_stdby_battery_svg",
			"has_on_off": true,
			"edges": [
				"#ess_bus"
			],
			"passthrough": true
		},
		{
			"id": "#switch_stb_arm",
			"has_on_off": true,
			"edges": [
				"#breaker_ess_stdby_battery_svg",
				"#standby_battery_paths"
			],
			"shared": [
				"#switch_stb_test"
			],
			"passthrough": false
		},
		{
			"id": "#switch_stb_test",
			"has_on_off": true,
			"edges": [
				"#standby_battery_paths",
				"#standby_battery_test_paths",
				"#test_led"
			],
			"shared": [
				"#switch_stb_arm"
			],
			"passthrough": false
		},
		{
			"id": "#standby_battery_paths",
			"has_on_off": false,
			"edges": [
				"#switch_stb_arm",
				"#switch_stb_test"
			],
			"passthrough": true
		},
		{
			"id": "#switch_stb_active",
			"has_on_off": true,
			"edges": [
				"#standby_battery_paths"
			],
			"passthrough": true
		},
		{
			"id": "#standby_battery_test_paths",
			"has_on_off": false,
			"edges": [
				"#switch_stb_test"
			],
			"passthrough": true
		},
		{
			"id": "#test_voltage_sense",
			"has_on_off": false,
			"edges": [
				"#standby_battery_test_paths"
			],
			"passthrough": true
		},
		{
			"id": "#test_led",
			"has_on_off": false,
			"edges": [
				"#switch_stb_test"
			],
			"passthrough": true
		}
	]
}

			{
				"name": "ground",
				"parent_id": "#ground",
				"states": [
					"class_id": "active",
					"edges": [
						"external_power_relay"
					]
				]
			},
